__author__="Arsentyeva N."

# Дана длина ребра куба. Найти объём куба и площадь его боковой поверхности.

a = float(input())
V = a**3
S = 4*a*a
print(f"Объем куба = {V:2f} \nПлощадь его боковой поверхности = {S:2f}", )

